modules/Hotel/Controllers/HotelController.php

    public function detail(Request $request, $id)
    {
        $row = $this->hotelService->getHotelDetailFromCache($id);
        if ( empty($row)) {
            return redirect('/');
        }
        $translation = $row;
        $hotel_related = [];
        $location_id = $request->location_id;
        // if (!empty($location_id)) {
        //     $hotel_related = $this->hotelClass::where('location_id', $location_id)->where("status", "publish")->take(4)->whereNotIn('id', [$row->id])->with(['location','translation','hasWishList'])->get();
        // }
        $review_list = '';
        $data = [
            'row'          => $row,
            'translation'       => $translation,
            'hotel_related' => $hotel_related,
            'location_category'=>$this->locationCategoryClass::where("status", "publish")->with('location_category_translations')->get(),
---
select * from `location_category` where `status` = 'publish' and `location_category`.`deleted_at` is null