modules/Booking/Controllers/BookingController.php

select * from `bravo_hotel_room_bookings` where `booking_id` = 105
select * from `bravo_hotel_room_bookings` where `bravo_hotel_room_bookings`.`id` = 34 limit 1
---
        }
        $isBooked=false;
        if($service == 'hotel'){
            $rooms = HotelRoomBooking::where('booking_id',$booking->id)->get();
            foreach($rooms as $room){
                $isBooked = $this->hotelService->bookRoom($request, $room, $booking);
                $updateRoom = HotelRoomBooking::find($room->id);