modules/Core/Models/Settings.php

    public static function getSettings($group = '',$locale = '')
    {
        if ($group) {
            static::where('group', $group);
        }
        $all = static::groupBy('name')->get();
---
select * from `core_settings` group by `name`

public static function item($item, $default = false)
{
    // Directly query the database to get the setting value without caching
    $val = Settings::where('name', $item)->first();
---
select * from `core_settings` where `name` = 'update_to_110' limit 1